Backend/app/controllers/gesture_files_controller.rb

SELECT "gesture_files".* FROM "gesture_files"
---
    def index
        @gesture_files = GestureFile.all

INSERT INTO "gesture_files" ("name", "gesture1", "gesture2", "gesture3", "gesture4", "gesture5", "gesture6", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
      @gesture_file = GestureFile.new(gesture_file_params)

      # Adjuntar el archivo si está presente
      if params[:gesture_file][:file].present?
        @gesture_file.file.attach(params[:gesture_file][:file])
      end

      if @gesture_file.save

SELECT "gesture_files".* FROM "gesture_files" WHERE "gesture_files"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "gesture_files" SET "gesture5" = $1, "updated_at" = $2 WHERE "gesture_files"."id" = $3  [["gesture5", "TouchApp"], ["updated_at", "2024-12-04 18:38:01.096406"], ["id", 6]]
---
    def update
      @gesture_file = GestureFile.find(params[:id])
      if @gesture_file.update(gesture_file_params)

DELETE FROM "gesture_files" WHERE "gesture_files"."id" = $1  [["id", 4]]
---
    def destroy
      @gesture_file.destroy

SELECT "gesture_files".* FROM "gesture_files" WHERE "gesture_files"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_gesture_file
      @gesture_file = GestureFile.find(params[:id])