Backend/app/controllers/lockers_controller.rb

  def create
    @locker = Locker.new(locker_params)
    @locker.key_sequence ||= Gesture.pluck(:gesture_type).sample(4).join('-')

    if @locker.save
---
SELECT "gestures"."gesture_type" FROM "gestures"
INSERT INTO "lockers" ("nombre", "locker_controller_id", "owner_email", "key_sequence", "abierto", "created_at", "updated_at", "intPassword") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update

      previous_state = @locker.abierto

    if @locker.update(abierto: params[:abierto])
---
UPDATE "lockers" SET "abierto" = $1, "updated_at" = $2 WHERE "lockers"."id" = $3  [["abierto", true], ["updated_at", "2024-12-02 20:54:21.186771"], ["id", 1]]

  def destroy
    @locker.destroy
---
DELETE FROM "lockers" WHERE "lockers"."id" = $1  [["id", 8]]

  def send_code
    # Debugging step to ensure locker is set
    puts "Locker ID: #{params[:id]}" # Debugging output
    @locker = Locker.find_by(id: params[:id])

    # Check if locker was found
    if @locker.nil?
      render json: { error: 'Locker not found' }, status: :not_found
      return
    end

    # Generate new key sequence and update locker
    new_key_sequence = Gesture.pluck(:gesture_type).sample(4).join('-')
    new_int_password = Array.new(4) { rand(1..6) }.join.to_i
    @locker.update!(key_sequence: new_key_sequence, intPassword: new_int_password)
---
SELECT "lockers".* FROM "lockers" WHERE "lockers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gestures"."gesture_type" FROM "gestures"
UPDATE "lockers" SET "updated_at" = $1, "intPassword" = $2 WHERE "lockers"."id" = $3  [["updated_at", "2024-12-04 21:24:47.073660"], ["intPassword", "[FILTERED]"], ["id", 1]]

  def set_locker
    @locker = Locker.find(params[:id])
---
SELECT "lockers".* FROM "lockers" WHERE "lockers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def set_locker_controller
    @locker_controller = LockerController.find(params[:locker_controller_id])  # Find the locker controller
---
SELECT "locker_controllers".* FROM "locker_controllers" WHERE "locker_controllers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]