Backend/app/controllers/lockers_controller.rb

SELECT "lockers".* FROM "lockers" WHERE "lockers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gestures"."gesture_type" FROM "gestures"
UPDATE "lockers" SET "owner_email" = $1, "updated_at" = $2 WHERE "lockers"."id" = $3  [["owner_email", "[FILTERED]"], ["updated_at", "2024-12-04 21:49:59.299956"], ["id", 2]]
---
  def send_code
    # Debugging step to ensure locker is set
    puts "Locker ID: #{params[:id]}" # Debugging output
    @locker = Locker.find_by(id: params[:id])

    # Check if locker was found
    if @locker.nil?
      render json: { error: 'Locker not found' }, status: :not_found
      return
    end

    # Generate new key sequence and update locker
    new_key_sequence = Gesture.pluck(:gesture_type).sample(4).join('-')
    @locker.update!(key_sequence: new_key_sequence)

SELECT "locker_controllers".* FROM "locker_controllers" WHERE "locker_controllers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_locker_controller
    @locker_controller = LockerController.find(params[:locker_controller_id])  # Find the locker controller