Backend/app/controllers/locker_controllers_controller.rb

  def index
    locker_controllers = LockerController.all
---
SELECT "locker_controllers".* FROM "locker_controllers"

  def show
    @locker_controller = LockerController.find(params[:id])
---
SELECT "locker_controllers".* FROM "locker_controllers" WHERE "locker_controllers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @locker_controller = LockerController.new(locker_controller_params)

    if @locker_controller.save
---
INSERT INTO "locker_controllers" ("nombre", "estado", "ultima_conexion", "casilleros_activos", "alert_sent", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def count
    count = LockerController.count
---
SELECT COUNT(*) FROM "locker_controllers"