Backend/app/controllers/users_controller.rb

    def count
      user_count = User.count
---
SELECT COUNT(*) FROM "users"